<?php

return [
	'REQUIRED_SELECT'       => 'выберите вариант из списка',
	'REQUIRED_INPUT'        => 'поле обязательно для заполнения',
	'SELECT_INVALID_VALUE'  => 'выбрано недопустимое значение',
	'PATTERN_MISMATCH'      => 'неправильно заполнено поле',
	'NUMERIC_VALUE'         => 'поле может содержать только числа',
	'MIN_VALUE'             => 'минимальное значение: [%s]',
	'MAX_VALUE'             => 'максимальное значение: [%s]',
	'ATTRIBUTE_REQUIRED'    => 'не указан обязательный атрибут [%s1]',
	'INVALID_FIELD_TYPE'    => "неверный тип поля формы: [%s1]",
	'INVALID_FILE_EXT'      => 'Недопустимый тип файла',
	'UPLOAD_ERR_INI_SIZE'   => 'Размер принятого файла превысил максимально допустимый размер',
	'UPLOAD_ERR_FORM_SIZE'  => 'Размер выбранного файла превышает допустимое значение',
	'UPLOAD_ERR_PARTIAL'    => 'Загружаемый файл был получен только частично',
	'UPLOAD_ERR_NO_FILE'    => 'Файл не выбран',
	'UPLOAD_ERR_NO_TMP_DIR' => 'Отсутствует временная папка',
	'UPLOAD_ERR_CANT_WRITE' => 'Не удалось записать файл на диск',
	'UPLOAD_ERR_EXTENSION'  => 'PHP-расширение остановило загрузку файла',
	'UPLOAD_UNKNOWN_ERROR'  => 'Неизвестная ошибка загрузки'
];